Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: ཡི་དགས་དེ་དག་གིས་དེ་མཐོང་ནས་སངས་རྒྱས་མཐོང་བའི་བདེ་བས་ལུས་ཚིམ་པར་གྱུར་ནས་འདི་སྙམ་དུ་སེམས་ཅན་འདིའི་མཐུས་བདག་ཅག་གིས་བདེ་བའི་ཚོར་བ་ཐོབ་བོ་སྙམ་དུ་སེམས་ཏེ། དེ་དག་བཅོམ་ལྡན་འདས་ལ་དགའ་ཞིང་དང་ལ་གུས་པ་སྐྱེས་པ་དང་།
en: When the pretas saw them, they were happy and satisfied. They thought, “It is through the power of this being that I have obtained this experience of bliss” and they had affection, delight, and respect for the appearance of the Bhagavat.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་ལ་བཀའ་སྩལ་པ།
en: The Bhagavat said to them, “You beings here!

source: སེམས་ཅན་དག་ཚུར་ཤེག །
en: Recite these words: ‘Homage to the Buddha, homage to the Dharma, homage to the Saṅgha,’ and you will always have this kind of bliss.

source: ཁྱེད་ཅག་སངས་རྒྱས་ལ་ཕྱག་འཚལ་ལོ།
en: Then those pretas placed their palms together and recited, “Homage to the Buddha!

source: །དགེ་འདུན་ལ་ཕྱག་འཚལ་ལོ་ཞེས་ཚིག་དེ་སྐད་བརྗོད་ཅིག་དང་ཞེས་བྱ་བ་ནས།
en: Homage to the Saṅgha!”

source: དགེ་བའི་རྩ་བ་དེས་དེ་ནས་ཤི་འཕོས་ནས་ཁ་ཅིག་ནི་ལྷ་རྣམས་ཀྱི་ནང་དུ་སྐྱེས་སོ། །ཁ་ཅིག་ནི་མི་རྣམས་ཀྱི་ནང་དུ་སྐྱེས་པའི་བར་དུ་གྱུར་ཏོ།
en: Because of that root of virtue, those preta beings departed that life, some to be born among devas and some among humans.

source: །དུད་འགྲོ་རྣམས་ལ་ཡང་དེ་བཞིན་དུ་བསྐུལ།
en: The Bhagavat also instructed the animals in that way.

source: མི་རྣམས་ལ་ཡང་དེ་བཞིན་དུ་བསྐུལ་ནས།
en: He also instructed the humans in that way.

source: ལྷ་དང་མི་བགྲང་བ་ལས་ཡང་དག་པར་འདས་པ་དག་ཆོས་མཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་དྲུང་དུ་ལྷགས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་འཁོད་དོ།
en: Devas and humans beyond number came to the Bhagavat, bowed their heads to his feet, and sat down to hear the Dharma.

source: །དེའི་ཚེ་ན་ལྷ་དང་། མིའི་ཚོགས་བགྲང་བ་ལས་ཡང་དག་པར་འདས་པ་དག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་གྱུར་ཏོ། །བྱང་ཆུབ་སེམས་དཔའ་བགྲང་བ་ལས་ཡང་དག་པར་འདས་པ་དག་གིས་ནི་དེར་ཏིང་ངེ་འཛིན་དང་། བཟོད་པ་དང་། གཟུངས་ཐོབ་པར་གྱུར་ཏོ།
en: At that time, numberless assemblies of devas and humans developed the motivation to attain the highest, most complete enlightenment, and countless bodhisattvas there attained samādhi, acceptance, and dhāraṇī.

source: །ཐེག་པ་ཆེན་པོའི་མདོ་སྙིང་རྗེ་པད་མ་དཀར་པོ་ལས་གཟུངས་ཀྱི་སྒོའི་ལེའུ་སྟེ་གཉིས་པའོ།། །།
en: That concludes “The Dhāraṇī Entranceway,” which is the second chapter of the Mahāyāna sūtra titled The White Lotus of Compassion.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རང་གིས་རྫུ་འཕྲུལ་མངོན་པར་མཛད་པ་སླར་བསྡུས་པ་དང་། བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་ཞི་བས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་རྒྱུ་གང་དང་རྐྱེན་གང་གིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གཞན་དག་གི་སངས་རྒྱས་ཀྱི་ཞིང་ནི་ཡོངས་སུ་དག་ཅིང་རྙོག་པ་མ་མཆིས་ལ། སྙིགས་མ་ལྔ་དང་བྲལ་ཞིང་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་སྣ་ཚོགས་དག་མཆིས་ལ།
en: Generosity Chapter 3 When the Bhagavat had concluded his miraculous manifestation, the bodhisattva mahāsattva Śāntimati asked the Bhagavat, “Bhagavat, by what cause and circumstances are the pure buddha realms of other buddhas unpolluted, free from the five degeneracies, and have the array of the various qualities of a buddha realm?

source: དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐམས་ཅད་ཀྱང་ཡོན་ཏན་རྣམ་པ་སྣ་ཚོགས་ཡོངས་སུ་རྫོགས་ཤིང་བདེ་བ་སྣ་ཚོགས་དང་ལྡན་ལ།
en: All the bodhisattva mahāsattvas there have a perfection of the various kinds of good qualities and possess the various kinds of happiness.

source: དེ་ན་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་རྣམས་ཀྱི་མིང་ཡང་མ་མཆིས་ན།
en: Even the words śrāvaka and pratyekabuddha are unknown there, let alone the word rebirth. “

source: སྐྱེ་བ་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ་བར་གྱུར་ལགས། བཅོམ་ལྡན་འདས་རྒྱུ་གང་དང་རྐྱེན་གང་གིས་བཅོམ་ལྡན་འདས་ནི་སངས་རྒྱས་ཀྱི་ཞིང་སྨད་པར་འཁྲུགས་ཤིང་།
en: Bhadanta Bhagavat, by what cause and circumstances has the Bhagavat appeared in a buddha realm that is inferior and troubled?

source: ཚེའི་སྙིགས་མ་དང་། དུས་ཀྱི་སྙིགས་མ་དང་། སེམས་ཅན་གྱི་སྙིགས་མ་དང་། ལྟ་བའི་སྙིགས་མ་དང་། ཉོན་མོངས་པའི་སྙིགས་མ་བྱུང་བར་གྱུར་པ་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་འཁོར་བཞི་པོ་དག་ལ་ཐེག་པ་གསུམ་ལས་བརྩམས་ཏེ་ཆོས་བསྟན་པར་མཛད་ལགས།
en: Why did you attain the complete enlightenment of perfect buddhahood and introduce the three yānas, teaching the Dharma to the fourfold assembly, during the degeneration of lifespan, degeneration of time, degeneration of beings, degeneration of view, and degeneration through the kleśas?

source: ཅིའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་སྙིགས་མ་ལྔ་དང་བྲལ་ཞིང་ཡོངས་སུ་དག་པ་ཡོངས་སུ་མ་བཟུང་ལགས།
en: Why did the Bhagavat not obtain a pure buddha realm free from the five degeneracies?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་སྨོན་ལམ་གྱི་དབང་གིས་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་ཡོངས་སུ་འཛིན་པར་བྱེད་ཅིང་སྨོན་ལམ་གྱི་དབང་གིས་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་མ་དག་པ་ཡང་ཡོངས་སུ་འཛིན་པར་བྱེད་དོ།
en: Noble son,” answered the Bhagavat, “it is through the power of prayer that bodhisattvas obtain pure buddha realms and through the power of prayer that they obtain impure buddha realms.

source: །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པའི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་མ་དག་པ་ཡང་ཡོངས་སུ་འཛིན་པར་བྱེད་པའོ།
en: Noble son, bodhisattva mahāsattvas obtain impure buddha realms because of their great compassion.

source: འདི་ལྟར་ང་ད་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་སྨད་པ་འདི་ལྟ་བུར་སྐྱེས་པ་ཡང་ངས་དེ་ལྟར་སྨོན་ལམ་བཏབ་པའི་ཕྱིར་ཏེ།
en: I have now been born into this inferior buddha realm because of the prayer that I made.

source: དེ་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་། ངས་ཁྱོད་ལ་བཤད་པར་བྱའོ། །བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་ཞི་བས་བཅོམ་ལྡན་འདས་དེ་བཞིན་ནོ་ཞེས་གསོལ་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་།
en: Listen well and correctly, and remember, for I am going to explain it to you.” “I will do so, Bhagavat,” said the bodhisattva Śāntimati.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་སྔོན་བྱུང་བ་བསྐལ་པ་གྲངས་མེད་པ་གང་གཱའི་ཀླུང་གཅིག་གི་བྱེ་མ་སྙེད་འདས་པ་ན་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་བསྐལ་པ་ཆེན་པོ་འཛིན་པ་ཞེས་བྱ་བ་ཞིག་བྱུང་སྟེ།
en: The Bhagavat then spoke these words: “Noble son, in the past, countless eons ago, as many as there are grains of sand in the Ganges River, in this buddha realm there was a great eon called Dhāraṇa.

source: བསྐལ་པ་ཆེན་པོ་དེ་ལ་གླིང་བཞི་པའི་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་གླིང་བཞི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་ཅེས་བྱ་བ་ཞིག་བྱུང་ངོ་།
en: During that great eon, within this buddha realm of four continents there was a king named Araṇemin who was a cakravartin sovereign over four continents. “

source: །རྩིབས་ཀྱི་མུ་ཁྱུད་དེ་ལ་མདུན་ན་འདོན་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་ཅེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: Araṇemin’s court priest was a brahmin named Samudrareṇu.

source: དེའི་བུ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་ལྡན་ཞིང་དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུས་ལུས་རྣམ་པར་མཛེས་ལ་བསོད་ནམས་བརྒྱའི་མཚན་དང་ལྡན་ཞིང་འོད་འདོམ་གང་བ་ཡོད་ལ།
en: To him was born a son who possessed the thirty-two signs of a great being, was beautified by the eighty excellent features of a great being, had the signs of a hundred merits, and had an aura that was a fathom wide and round like a banyan tree.

source: ཤིང་ནྱ་གྲོ་དྷ་ལྟར་ཆུ་ཞེང་གབ་ཅིང་ལྟ་བས་ཆོག་མི་ཤེས་པ་ཞིག་བཙས་སོ།
en: One never tired of gazing upon him. “

source: །དེ་བཙས་མ་ཐག་ཏུ་ལྷ་འབུམ་གྱིས་མཆོད་པ་བྱས་ནས། རྒྱ་མཚོའི་སྙིང་པོ་ཞེས་བྱ་བར་མིང་བཏགས་སོ།
en: As soon as he was born, a hundred thousand devas made offerings to him, and then he was given the name Samudragarbha.

source: །དེ་དུས་གཞན་ཞིག་ན་ངེས་པར་བྱུང་ནས་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ཏེ་གོས་ངུར་སྨྲིག་བགོས་ནས།
en: At a certain time, he renounced worldly life, shaved off his hair and mustache, and donned saffron robes.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ།
en: He attained the highest, most complete enlightenment of buddhahood.

source: དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོ་ཞེས་བྱ་བར་གྱུར་ནས་བཅོམ་ལྡན་འདས་དེས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་ཏེ་སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་མང་པོ་དག་མཐོ་རིས་དང་ཐར་པའི་འབྲས་བུ་ལ་རབ་ཏུ་བཀོད་པར་གྱུར་ཏོ།
en: He became the tathāgata named Ratnagarbha. That bhagavat turned the wheel of the Dharma and led many hundreds of thousands of millions of trillions of beings to the results of rebirth in higher realms and liberation. “

source: །དེ་དུས་གཞན་ཞིག་ན་ཉན་ཐོས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་མང་པོ་དག་གིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ནས་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་། ཡུལ་འཁོར་དང་།
en: At one time, with many hundreds of thousands of millions of trillions of śrāvakas accompanying and attending him, he went to villages, cities, towns, districts, countries, and kings’ palaces.

source: རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་རྣམས་སུ་རྒྱུ་ཞིང་གཤེགས་ཏེ། རིམ་གྱིས་གང་ན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་དེ་གནས་པའི་གྲོང་ཁྱེར་གཞན་ཞིག་ཏུ་གཤེགས་སོ།
en: Going from one town to another, he eventually came to the city where the cakravartin king lived.

source: །དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་སྙིང་པོ་གྲོང་ཁྱེར་གྱི་ཕྱི་རོལ་ནས་ཧ་ཅང་ཡང་མི་རིང་བ་ན་འཛམ་བུའི་ཚལ་ཞེས་བྱ་བའི་སྐྱེད་མོས་ཚལ་ཞིག་ཡོད་པ་ན་ཉན་ཐོས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་སོ།
en: There the tathāgata arhat samyaksam­buddha Ratnagarbha sat together with many hundreds of thousands of millions of trillions of śrāvakas outside the city in a nearby park called Jambūvana. “

source: །རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་སྙིང་པོ་བདག་གི་ཡུལ་དུ་གཤེགས་ནས། འཛམ་བུའི་ཚལ་གྱི་སྐྱེད་མོས་ཚལ་ན་ཉན་ཐོས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་སོ་ཞེས་ཐོས་ནས་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་སོང་ལ་ཕྱིན་ནས་ཀྱང་དེ་བཞིན་གཤེགས་པ་དེ་ལ་བསྟི་སྟང་དུ་བྱ། བླ་མར་བྱ། རི་མོར་བྱ། མཆོད་པར་བྱ་གོར་མ་ཆག་སྙམ་མོ།
en: King Araṇemin heard that the tathāgata arhat samyaksam­buddha Ratnagarbha had come to his land and was residing in Jambūvana Park together with many hundreds of thousands of millions of trillions of śrāvakas and thought, ‘I will go there now, and when I have arrived there, I will pay my respects to the Tathāgata, venerate him, and honor him.’ “

source: །དེ་ནས་རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་རྒྱལ་པོའི་འབྱོར་པ་ཆེན་པོ་དང་། རྒྱལ་པོའི་མཐུ་ཆེན་པོས་སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ། གྲོང་ཁྱེར་ནས་བྱུང་ཞིང་འཛམ་བུའི་ཚལ་གྱི་སྐྱེད་མོས་ཚལ་ག་ལ་བ་དེར་སོང་ནས་བཞོན་པས་བགྲོད་པའི་ས་ཇི་སྲིད་པ་དེ་སྲིད་དུ་བཞོན་པས་སོང་སྟེ་ཕྱིན་པ་དང་།
en: Then King Araṇemin, with a king’s great wealth and with a king’s great power, accompanied and attended by many hundreds of thousands of millions of trillions of individuals, left the city and went toward Jambūvana Park.

source: རྐང་པས་ཀུན་དགའི་ར་བར་ཞུགས་ནས།
en: He traveled by carriage for as far as there was ground for a carriage to travel on, and then he continued on foot and entered the parkland. “

source: དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་སྙིང་པོའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ལན་གསུམ་དུ་བསྐོར་བ་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: He went toward the Tathāgata Ratnagarbha, bowed his head to the tathāgata arhat samyaksam­buddha Ratnagarbha’s feet, circumambulated him three times, and then sat to one side.

source: །ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་ཀྱང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་སྙིང་པོས་རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་ལ་ཆོས་ཀྱི་གཏམ་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག ། ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པར་རབ་ཏུ་དགའ་བར་མཛད་དོ།
en: When he was seated to one side, the tathāgata arhat samyaksam­buddha Ratnagarbha taught King Araṇemin by speaking about the Dharma, which inspired him, encouraged him, and delighted him.

source: །རྣམ་གྲངས་དུ་མར་ཆོས་ཀྱི་གཏམ་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པར་རབ་ཏུ་དགའ་བར་མཛད་ནས་ཅང་མི་གསུང་བར་གྱུར་ཏོ།། །།བམ་པོ་གསུམ་པ།
en: After he taught him the Dharma in many ways and inspired him, encouraged him, and delighted him, he became silent. “

source: དེ་ནས་རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོ་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་ཞབས་གཉིས་ལ་གཏུགས་ནས། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་སྙིང་པོ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་གིས་དགུང་ཟླ་གསུམ་པོ་འདི་ལ་བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པ་ལ་ན་བཟའ་དང་།
en: Then King Araṇemin rose from his seat, bared one shoulder, bowed with palms together toward the Tathāgata Ratnagarbha, and touched his feet.

source: བཤོས་དང་། གཟིམས་ཆ་དང་། གདན་དང་། སྙུན་གྱི་གསོས་སྨན་དང་། ཡོ་བྱད་རྣམས་ཀྱིས་བསྙེན་བཀུར་བགྱི་བར་འཚལ་ན་བཅོམ་ལྡན་འདས་དང་དགེ་སློང་གི་དགེ་འདུན་གྱིས་གནང་བར་མཛད་དུ་གསོལ།
en: He then said these words to the tathāgata arhat samyaksam­buddha Ratnagarbha: ‘May the Bhagavat and his saṅgha of bhikṣus give their permission that for three months I may provide the Bhagavat and his bhikṣus with robes, food, beds, seats, medicine, and necessities.’ “

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས་རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་ལ་ཅང་མི་གསུང་བས་གནང་བར་མཛད་དོ།
en: Noble son, the Tathāgata Ratnagarbha gave his permission to King Araṇemin by remaining silent.

source: །དེ་ནས་རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས་ཅང་མི་གསུང་བས་གནང་བར་རིག་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ལན་གསུམ་བསྐོར་བ་བྱས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་ནས་སོང་ངོ་།
en: King Araṇemin understood from the Tathāgata Ratnagarbha’s silence that he had given his permission, bowed his head to the Bhagavat’s feet, circumambulated him three times, and then departed from the Bhagavat’s presence.

source: །དེ་ནས་རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་ཀྱིས་ཁམས་ཀྱི་རྒྱལ་པོ་རྣམས་དང་། བློན་པོ་རྣམས་དང་། སྣ་ཆེན་པོ་ལ་གཏོགས་པ་རྣམས་དང་། བློན་པོ་ཕྲ་མོ་རྣམས་དང་། གྲོང་མི་རྣམས་དང་།
en: Then King Araṇemin summoned the local kings, ministers, high officials, lesser ministers, and representatives of the city dwellers, countryside dwellers, and hired laborers.

source: ལྗོངས་ཀྱི་མི་རྣམས་དང་། ཞོ་ཤས་འཚོ་བའི་མི་རྣམས་བོས་ཏེ་སྨྲས་པ། གཙོ་བོ་དག་ཤེས་པར་གྱིས་ཤིག །
en: He said to them, ‘Leaders of men, know this!

source: ངས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་སྙིང་པོ་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པ་ཟླ་བ་གསུམ་པོ་འདི་ལ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་ངེས་པར་སྤྱན་དྲངས་ཏེ། ང་ལ་ཉེ་བར་སྤྱད་པ་དང་།
en: For the next three months I will provide all necessities for the tathāgata arhat samyaksam­buddha Ratnagarbha and his saṅgha of bhikṣus.

source: ཡོངས་སུ་སྤྱད་པ་དང་། བསྙེན་བཀུར་བྱ་བ་དང་། དགའ་མགུར་སྤྱད་པ་དང་། བཙུན་མོའི་འཁོར་གང་ཅི་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ངས་བཅོམ་ལྡན་འདས་དང་། དགེ་སློང་གི་དགེ་འདུན་ལ་གུས་པར་བྱས་ཏེ་ཕུལ་གྱིས།
en: I will respectfully offer to the Bhagavat and his saṅgha of bhikṣus all my pleasures and enjoyments, honors, amusements, and queens.

source: ཁྱེད་ཅག་ལ་གང་ཟག་གིས་ཉེ་བར་སྤྱད་པ་དང་། ཡོངས་སུ་སྤྱད་པ་དང་། བསྙེན་བཀུར་བྱ་བ་དང་། དགའ་མགུར་སྤྱད་པ་དང་། ཆུང་མའི་འཁོར་ཇི་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་བཅོམ་ལྡན་འདས་དང་དགེ་སློང་གི་དགེ་འདུན་ལ་གུས་པར་ཕུལ་ཅིག་ཅེས་བསྒོ་ནས།
en: You too should respectfully offer to the Bhagavat and his saṅgha of bhikṣus all your own individual pleasures and enjoyments, honors, amusements, and wives.’ “

source: དེ་དག་གིས་ཀྱང་དེ་བཞིན་དུ་ཕུལ་ལོ།
en: They made offerings in that way.

source: །ཁྱིམ་བདག་རིན་པོ་ཆེས་ཀྱང་སྐྱེད་མོས་ཚལ་བཟང་པོ་ཐམས་ཅད་འཛམ་བུའི་ཆུ་བོའི་གསེར་ལས་བྱས་ཤིང་སྐྱེད་མོས་ཚལ་དེ་ཉིད་དུ་བཅོམ་ལྡན་འདས་ཀྱི་ཕྱིར་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཁང་པ་བརྩེགས་པ་བརྩིགས་ཏེ།
en: Also, the precious householder created a parkland entirely of Jambu River gold. In that parkland, he created for the Tathāgata a kūṭāgāra made from the seven jewels.

source: དེའི་ཕྱོགས་བཞི་ཁོ་ར་ཁོར་ཡུག་དག་ཏུ་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་སྒོ་དག་ཀྱང་བཏོད་དོ།
en: He also had an enclosing wall made of the seven jewels built in the four directions.

source: །སྐྱེད་མོས་ཚལ་ཐམས་ཅད་ཀྱང་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཤིང་ལྗོན་པ་དག་གིས་བརྒྱན་ཏོ།
en: He also adorned the entire parkland with trees made of the seven jewels.

source: །ཤིང་ལྗོན་པ་དེ་དག་ཀྱང་གོས་སྣ་ཚོགས་དང་། རས་བཅོས་བུ་སྣ་ཚོགས་དང་། གདུགས་སྣ་ཚོགས་དང་། མུ་ཏིག་གི་ལྡ་ལྡི་སྣ་ཚོགས་དང་། རྒྱན་སྣ་ཚོགས་དང་།
en: Those trees were ornamented with cloth of various kinds, a variety of calico cloth, a variety of parasols, a variety of strings of pearls, ornaments of various kinds, a variety of adornments of jewels, and various incenses.

source: རིན་པོ་ཆེའི་རྒྱན་སྣ་ཚོགས་དང་། སྤོས་སྣ་ཚོགས་དག་གིས་ལེགས་པར་བརྒྱན་ཏོ། །ཤིང་ལྗོན་པ་དེ་དག་རིན་པོ་ཆེའི་མེ་ཏོག་དང་། འབྲས་བུ་ཐམས་ཅད་ཀྱིས་ཀྱང་བརྒྱན་ཏོ།
en: Those trees were also adorned with flowers and fruits made of every kind of jewel. “

source: །སྐྱེད་མོས་ཚལ་དེ་དག་ཐམས་ཅད་ནོར་བུ་རྣམ་པ་དུ་མ་དག་གིས་ཀྱང་བརྒྱན་ནས་མེ་ཏོག་སྣ་ཚོགས་བཀྲམ་ཞིང་དར་དང་།
en: That entire parkland was adorned with jewels of many kinds.

source: རས་བཅོས་བུ་དང་། བེའུ་རས་དང་། བགོ་བ་སྣ་ཚོགས་དག་གི་གདན་དག་ཀྱང་བཤམས་སོ།
en: Seats of calico, linen, and various kinds of cloth were arranged and scattered with a variety of flowers.

source: །འཁོར་ལོ་རིན་པོ་ཆེ་དེ་ཡང་ཁང་པ་བརྩེགས་པའི་ཕྱི་རོལ་གྱི་སྟེང་གི་བར་སྣང་ལ་མིའི་ཚད་ཙམ་དུ་རེད་དེ་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་བབ་པར་འབར་ཞིང་འདུག་གོ།
en: A precious wheel, the height of a man, shone outside the kūṭāgāra, in front of the Tathāgata.

source: །གླང་པོ་རིན་པོ་ཆེ་ཐལ་ཀར་ཡན་ལག་བདུན་ལེགས་པར་གནས་པ་ཡང་བཅོམ་ལྡན་འདས་ཀྱི་སྣམ་ལོགས་ན། བཅོམ་ལྡན་འདས་ཀྱི་སྟེང་དུ་རིན་པོ་ཆེའི་ཤིང་ལྗོན་པ་འཛིན་ཅིང་འདུག་སྟེ། ཤིང་ལྗོན་པ་དེ་ཡང་རིན་པོ་ཆེ་སྣ་བདུན་དང་།
en: Also, a completely white, precious seven-limbed elephant stood near the Bhagavat, holding a precious tree above him.

source: མུ་ཏིག་གི་ལྡ་ལྡི་སྣ་ཚོགས་དང་། རྒྱན་སྣ་ཚོགས་དང་། མེ་ཏོག་ཕྲེང་སྣ་ཚོགས་དག་གིས་བརྒྱན་ཅིང་། དར་སྣ་ཚོགས་དང་། རས་བཅོས་བུ་སྣ་ཚོགས་དག་གིས་ལེགས་པར་བརྒྱན་ནས་ཤིང་ལྗོན་པ་དེ་ལ་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་གདུགས་དག་ཀྱང་དཔྱངས་པར་གྱུར་ཏོ།
en: That tree was adorned with the seven jewels, various strings of pearls, various ornaments, and various garlands of flowers, and was hung with various silks and various lengths of calico. “

source: །རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་ཀྱི་བཙུན་མོ་དམ་པ་གང་ཡིན་པ་དེ་ཡང་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་ནས། བཅོམ་ལྡན་འདས་ལ་ཙན་དན་ས་མཆོག་པ་དང་། ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོའི་ཕྱེ་མ་དག་འཐོར་བར་བྱེད་དོ།
en: King Araṇemin’s principal queen stood before the Bhagavat, sprinkling the Bhagavat with gośīrṣa and uragasāra sandalwood powder.

source: །རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་ཀྱི་ནོར་བུ་རིན་པོ་ཆེ་འོད་གསལ་བར་གྱུར་པ་གང་ཡིན་པ་དེ་ཡང་རང་གིས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་བཞག་གོ།
en: King Araṇemin himself placed a shining, precious jewel before the Bhagavat.

source: །དེ་ནས་ནོར་བུ་རིན་པོ་ཆེ་དེའི་འོད་ཀྱིས་སྐྱེད་མོས་ཚལ་དེ་དག་ཐམས་ཅད་རྟག་པར་རྒྱུན་དུ་སྣང་བ་རྒྱ་ཆེན་པོས་ཁྱབ་པར་གྱུར་ཏོ།
en: Then the radiance of that precious jewel continuously and constantly filled the entire parkland with a vast radiance.

source: །སངས་རྒྱས་ཀྱི་འོད་ཀྱིས་ཀྱང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཐམས་ཅད་རྟག་པར་རྒྱུན་དུ་ཁྱབ་པར་གྱུར་ཏོ།
en: The Buddha’s light itself constantly illuminated all the worlds of this billion-world universe.

source: །ཉན་ཐོས་རེ་རེ་ལ་ཡང་ཙན་དན་ས་མཆོག་པའི་རྐང་རྟེན་དག་བཞག་གོ།
en: A footstool of gośīrṣa sandalwood was provided for each śrāvaka.

source: །ཉན་ཐོས་རེ་རེའི་རྒྱབ་ཏུ་ཡང་གླང་པོ་ཆེའི་གཙོ་བོ་ཐལ་ཀར་སྔ་མ་ལྟ་བུ་དག་དང་།
en: Behind each śrāvaka there was a white king of elephants, as previously described.

source: ཇི་ལྟར་བཅོམ་ལྡན་འདས་ལ་འཁོར་ལོ་རིན་པོ་ཆེའི་མིའི་ཚད་ཙམ་པ་བཞག་པ་དེ་ལྟ་བུ་དག་ཀྱང་བཞག་གོ།
en: There were also precious wheels, the height of a man, placed in the same way that one had been placed for the Bhagavat.

source: །ཉན་ཐོས་རེ་རེའི་མདུན་དུ་ཡང་བུ་མོ་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་དག་བཀོད་ནས་ཙན་དན་ས་མཆོག་པའི་ཕྱེ་མ་དག་ཀྱང་འཐོར་བར་བྱེད་དོ། །ཉན་ཐོས་རེ་རེའི་མདུན་དུ་ནོར་བུ་བཻ་དཱུརྱ་དག་ཀྱང་བཞག་གོ།
en: A woman adorned with every kind of jewelry stood in front of each śrāvaka sprinkling gośīrṣa and uragasāra sandalwood powders, and in front of each śrāvaka a beryl jewel was placed. “

source: །སྐྱེད་མོས་ཚལ་གྱི་ནང་གི་ཁོ་ར་ཁོར་ཡུག་དག་ཏུ་རོལ་མོའི་སྒྲ་སྣ་ཚོགས་དག་ཀྱང་བསྒྲགས་སོ།
en: Various kinds of music resounded everywhere within the parkland’s walls.

source: །སྐྱེད་མོས་ཚལ་གྱི་ཕྱི་རོལ་གྱི་ཁོ་ར་ཁོར་ཡུག་དག་ན་བློན་པོ་རིན་པོ་ཆེ་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་དང་བཅས་པ་དག་ཀྱང་གནས་སོ།
en: The precious minister and fourfold army were stationed outside all around the walls of the parkland. “

source: །རིགས་ཀྱི་བུ་དེ་ནས་རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་དེ་བཅོམ་ལྡན་འདས་ལ་བལྟ་བ་དང་། བཅོམ་ལྡན་འདས་ལ་བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་ཉིན་གཅིག་བཞིན་དུ་གྲོང་ཁྱེར་ནས་བྱུང་སྟེ།
en: Noble son, King Araṇemin came from the city every day to see the Bhagavat and to honor the Bhagavat.

source: དེ་བཞོན་པས་བགྲོད་པའི་ས་ཇི་སྲིད་པ་དེ་སྲིད་དུ་བཞོན་པས་སོང་ནས་བཞོན་པ་ལས་བབས་ཏེ། རྐང་པས་སྐྱེད་མོས་ཚལ་དུ་ཞུགས་སོ།
en: He traveled by carriage for as far as there was ground for a carriage to travel on, and then he got down and, continuing on foot, entered the park.

source: །ཞུགས་ནས་ཀྱང་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་སྙིང་པོའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: After he had entered, he approached the Tathāgata Ratnagarbha.

source: ལན་གསུམ་བསྐོར་བ་བྱས་ནས། རང་གིས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོ་ཕྱག་ཆབ་གསོལ་ཏེ། བདག་ཉིད་ལག་དར་ནས་བཟའ་བ་དང་། བཅའ་བ་དང་། བལྡག་པ་དང་།
en: When he reached the tathāgata arhat samyaksam­buddha Ratnagarbha, he bowed his head to his feet, circumambulated him three times, and then personally offered water for the Tathāgata Ratnagarbha to rinse his hands.

source: བསོད་པ་མང་པོ་དག་ལེགས་པར་བསྟབས་ཤིང་ཚིམ་པར་བྱས་སོ།
en: He personally prepared with his own hands numerous offerings of food to the Tathāgata.

source: །བདག་ཉིད་ལག་དར་ཏེ་ལེགས་པར་བསྟབས་ཤིང་ཚིམ་པར་བྱས་ནས་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱིས་ཕྱག་ནས་ལྷུང་བཟེད་བཞག་སྟེ་ཕྱག་བཅབས་པར་རིག་ནས། བདག་ཉིད་ཀྱིས་བསིལ་ཡབ་བླངས་ཏེ་བཅོམ་ལྡན་འདས་ལ་གཡབས་སོ།
en: When he had prepared this food with his own hands, had satisfied the Bhagavat, and had seen that the bhagavat had eaten, put down his bowl, and washed his hands, then King Araṇemin himself held a fan and fanned the Bhagavat. “

source: །རྒྱལ་བུ་སྟོང་དང་། ཁམས་ཀྱི་རྒྱལ་པོ་སྟོང་གིས་ཀྱང་ཉན་ཐོས་རེ་རེ་ལ་དེ་ལྟ་བུའི་བསྙེན་བཀུར་བྱས་ནས་བསིལ་ཡབ་བླངས་ཏེ། ཉན་ཐོས་རྣམས་ལ་གཡབས་སོ།
en: A thousand princes and a thousand minor kings also carried out that service for each śrāvaka, and then, holding fans, they fanned the śrāvakas.

source: །ཞལ་ཟས་བྲིམ་པ་རྫོགས་ཏེ་གདུགས་ཚོད་གྱུ་མ་ཐག་ཏུ་སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་དག་ཀྱང་ཆོས་མཉན་པའི་ཕྱིར་ཀུན་དགའ་ར་བར་ལྷགས་སོ།
en: As soon as the meal ended, many hundreds of thousands of millions of trillions of beings entered the park in order to listen to the Dharma.

source: །ལྷ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་དག་གིས་ཀྱང་ནམ་མཁའི་དཀྱིལ་ནས་མེ་ཏོག་གི་ཆར་དག་མངོན་པར་རབ་ཏུ་ཕབ་ནས། ལྷའི་རོལ་མོའི་སྒྲ་དག་ཀྱང་རབ་ཏུ་བསྒྲགས་སོ། །ལྷའི་གདུགས་དང་། གོས་དང་། རྒྱན་དག་ཀྱང་རབ་ཏུ་དཔྱངས་སོ།
en: Many hundreds of thousands of millions of trillions of devas sent down a rain of flowers from the middle of the sky, played divine music, and presented divine parasols, cloth, and adornments. “

source: །གནོད་སྦྱིན་གོས་སྔོན་པོ་ཅན་ས་ཡ་ཕྲག་བཞིས་ཀྱང་བཅོམ་ལྡན་འདས་དང་དགེ་སློང་གི་དགེ་འདུན་བསྲུང་བའི་ཕྱིར་ཙན་དན་གྱི་ཚལ་ནས་ཙན་དན་ས་མཆོག་པའི་སྡོང་པོ་དག་བླངས་ནས་ཐུན་དུ་བླགས་ཏེ་མེལ་ཚེ་བྱེད་དོ།
en: Four million yakṣas in blue clothing brought staffs of gośīrṣa sandalwood from a sandalwood forest and stood guard in order to protect the Bhagavat and his saṅgha of bhikṣus. “

source: །རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་ཉིད་ཀྱིས་ཀྱང་མཚན་མོ་བཅོམ་ལྡན་འདས་དང་དགེ་སློང་གི་དགེ་འདུན་རྣམས་ཀྱི་སྤྱན་སྔར་མར་མེ་ཁ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་དག་བུས་སོ།
en: At night, King Araṇemin himself lit many hundreds of thousands of millions of trillions of lamps before the Bhagavat and his saṅgha of bhikṣus. “

source: །རིགས་ཀྱི་བུ་དེ་ནས་རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་ནས། མགོའི་སྟེང་དུ་ཡང་མར་མེའི་ཀོང་བུ་གཅིག་བཞག །ཕྲག་པ་གཉིས་དང་། ལག་པ་གཉིས་དང་། རྐང་པ་གཉིས་སུ་ཡང་མར་མེའི་ཀོང་བུ་རེ་རེ་བཞག་སྟེ།
en: Then, noble son, King Araṇemin stood before the Bhagavat with a lamp placed upon his head, a lamp on each shoulder, one in each hand, and one on each foot.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་མཚན་ཡལ་ན་ངས་སུ་མར་མེ་བཏང་ཡང་བཅོམ་ལྡན་འདས་ཀྱི་མཐུས་ལུས་ལ་ངལ་བ་མེད་ཅིང་།
en: Throughout the night these lamps burned before the Bhagavat.
